Jajukym/hello-world/Cypress/PSoC 4 BLE - Heart Rate Sensor/PSoC 4 BLE_Heart_Rate_Sensor.cydsn/codegentemp/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "CYBLE_gatt.h"
#include "CYBLE.h"
#include "CYBLE_hrs.h"
#include "CYBLE_HAL_PVT.h"
#include "CYBLE_STACK_PVT.h"
#include "CYBLE_StackGap.h"
#include "CYBLE_StackGatt.h"
#include "CYBLE_StackGattDb.h"
#include "CYBLE_StackHostMain.h"
#include "CYBLE_StackL2cap.h"
#include "CYBLE_dis.h"
#include "CYBLE_StackGattServer.h"
#include "CYBLE_StackGattClient.h"
#include "CYBLE_Stack.h"
#include "CYBLE_eventHandler.h"
#include "UART_DEB.h"
#include "UART_DEB_SPI_UART.h"
#include "UART_DEB_PINS.h"
#include "UART_DEB_SPI_UART_PVT.h"
#include "UART_DEB_PVT.h"
#include "UART_DEB_BOOT.h"
#include "SW2.h"
#include "SW2_aliases.h"
#include "Advertising_LED.h"
#include "Advertising_LED_aliases.h"
#include "Disconnect_LED.h"
#include "Disconnect_LED_aliases.h"
#include "Wakeup_Interrupt.h"
#include "WdtIsr.h"
#include "CYBLE_bless_isr.h"
#include "UART_DEB_SCBCLK.h"
#include "UART_DEB_tx.h"
#include "UART_DEB_tx_aliases.h"
#include "UART_DEB_rx.h"
#include "UART_DEB_rx_aliases.h"
#include "cy_em_eeprom.h"
#include "core_cm0_psoc4.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cyPm.h"
#include "cytypes.h"
#include "cypins.h"
#include "CyLFClk.h"

/*[]*/

